Dlubal.RFEM5.FreePolygonLoad
Free polygon load parameters.

Dlubal.RFEM5.FreePolygonLoad.No
Number

Dlubal.RFEM5.FreePolygonLoad.ID
Identifier

Dlubal.RFEM5.FreePolygonLoad.Comment
Comment

Dlubal.RFEM5.FreePolygonLoad.Tag
Tag

Dlubal.RFEM5.FreePolygonLoad.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.FreePolygonLoad.SurfaceList
List of surfaces on which is load defined.

Dlubal.RFEM5.FreePolygonLoad.ProjectionPlane
Projection plane of load

Dlubal.RFEM5.FreePolygonLoad.Direction
Load direction

Dlubal.RFEM5.FreePolygonLoad.Distribution
Load distribution

Dlubal.RFEM5.FreePolygonLoad.CornerPointList
Corner point coordinates in the projection plane.

Dlubal.RFEM5.FreePolygonLoad.Position
Load position

Dlubal.RFEM5.FreePolygonLoad.Point1No
First corner point number.

Dlubal.RFEM5.FreePolygonLoad.Point2No
Second corner point number.

Dlubal.RFEM5.FreePolygonLoad.Point3No
Third corner point number.

Dlubal.RFEM5.FreePolygonLoad.Magnitude1
Load magnitude at the first corner point.

Dlubal.RFEM5.FreePolygonLoad.Magnitude2
Load magnitude at the second corner point.

Dlubal.RFEM5.FreePolygonLoad.Magnitude3
Load magnitude at the third corner point.